<div class="row">
        <div class="col-lg-9">
            <h1>181.Employees Earning More Than Their Managers</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>The <code>Employee3</code> table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.</p>

<pre>
+----+-------+--------+-----------+
| Id | Name  | Salary | ManagerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |
+----+-------+--------+-----------+
</pre>

<p>Given the <code>Employee3</code> table, write a SQL query that finds out employees who earn more than their managers. For the above table, Joe is the only employee who earns more than his manager.</p>

<pre>
+----------+
| Employee |
+----------+
| Joe      |
+----------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
Employee = pd.read_sql_table("Employee3", engine)
Employee

   Id   Name  Salary  ManagerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

In [3]:
# Method 1
query = '''
SELECT e1.Name Employee
FROM Employee3 e1
INNER JOIN Employee3 e2
ON e1.ManagerId = e2.Id
WHERE e1.Salary > e2.Salary;
'''
pd.read_sql_query(query, engine)

  Employee
0      Joe

In [4]:
# Method 2
query = '''
SELECT e1.Name Employee
FROM Employee3 e1
WHERE e1.ManagerId IS NOT NULL 
AND e1.Salary > (SELECT e2.Salary 
                 FROM Employee3 e2
                 WHERE e1.ManagerId = e2.Id);
'''
pd.read_sql_query(query, engine)

  Employee
0      Joe

## Note
# Time: O(n^2)
# Space: O(1)
##### 1. INNER JOIN [VAR] ON [Condition] --> Show the complete matching.
##### 2. LEFT JOIN [VAR] ON [Condition] --> Show the matching based on all left table.